#!/usr/bin/env python
# coding=utf8

import datetime
import random
import sys
import json
from optparse import OptionParser

TOTAL_RECORD = 1130000
IAN_PERCENTAGE = 20
HENRY_PERCENTAGE = 20
IAN_USED = 0
HENRY_USED = 0

IAN = 'Ian'
HENRY = 'Henry'

LECTURERS = (
    'Isabel', 'Amy', 'Alexis', 'Lily', 'Kelly',
    'Bob', 'Pitt', 'Alen', 'Aaron', 'Brian',
)

STUDENTS = (
    '林怡靜', '李嘉玲', '王婉瑜', '張芳伯', '楊昌凌', '王祥諭', '柳又姍', '陳玟堯', '曾秋佐', '王志云',
    '林姿瑞', '黃婉映', '羅堅季', '蔡佳妹', '王雅雯', '呂奕辰', '林敬虹', '吳俊富', '李耀德', '陳青豐',
    '邱伊軍', '張玉竹', '宋安妍', '蘇雅芬', '陳珮星', '陳淑易', '程亦珠', '吳軒慈', '張雅茵', '張博謙',
    '劉建智', '賴淑芬', '胡秀娟', '杜家綺', '張智和', '李涵琇', '郭威廷', '李庭枝', '趙承恩', '王詩合',
    '蔡美君', '林祐惟', '林昆霖', '張昇恒', '趙秀琴', '杜隆侑', '連尚菁', '陳佳霖', '楊怡婷', '俞志穎',
    '謝佳綸', '詹雅威', '黃佳芝', '黃慧茹', '林立淳', '陳綺幸', '劉怡軒', '鄭亦欣', '王俊凱', '李仲芬',
    '劉儀梅', '賴冠儒', '郭琬儒', '楊智男', '王瑜月', '陳婉婷', '邱乃文', '許淑芳', '朱蘭妤', '朱與瑞',
    '李合綸', '林怡文', '周建勳', '童孟旺', '黃冠然', '陳詩婷', '林鈺婷', '倪郁夢', '黃柏翔', '莊惠竹',
    '戴惠娟', '林湘寧', '蔡哲宇', '陳雯修', '林薇軒', '侯怡君', '洪育綠', '鄂淑娟', '吳則夫', '林翊丹',
    '張禮源', '黃靜如', '李志銘', '劉真旺', '鄭堯琬', '袁行花', '林財谷', '高冰胤', '楊啟吟', '李政屏',
    '林淑梅', '林佳娟', '梁寧坤', '鄭予達', '陳心樺', '吳宏彬', '姚惠婷', '彭映洋', '蔣名勇', '陳麗卿',
    '郭志宏', '陳志林', '王怡琪', '潘志偉', '陸倩恭', '李孝辰', '楊志穎', '侯學洋', '吳秋映', '賴雅玲',
    '張政峰', '朱又霞', '鄭偉翔', '李仕火', '劉語愛', '林盈芝', '陳佳俐', '宗一吟', '劉育岑', '黃信佳',
    '張家琪', '吳儒方', '黃憶士', '吳雅雯', '劉文婷', '倪廷芷', '陳威廷', '蔡紹勇', '胡淑慧', '楊奎豐',
    '張盈甄', '蘇仁傑', '陳瑩一', '楊文欣', '陳世松', '郭哲瑋', '韓宗翰', '杜鈺雯', '吳文城', '盧振鳳',
    '黃麗旭', '陳得娥', '王弘德', '張慧茹', '莊雅岑', '蔡隆能', '李人豪', '蔡佳娟', '李秀琴', '張慧珊',
    '袁紹士', '張哲嘉', '郭雅筑', '黃宗穎', '朱兆善', '張茹韋', '蔡冠羽', '王建松', '洪素劭', '林凱利',
    '李婉易', '楊智利', '曾怡廷', '傅婷峰', '李慈倩', '林則芸', '林靜宜', '劉冠淳', '黃怡慧', '曾彥均',
    '郝昇啟', '丁柏成', '藍豐儀', '王茂亨', '陳志茵', '張右仲', '王姿齊', '林岳林', '袁惠雯', '侯志諭',
    '吳惠珊', '姚偉銘', '王智翰', '張智翔', '王建旭', '徐夙齊', '楊馨苓', '李冠勳', '呂信宏', '權彥良',
    '張育霞', '林育城', '吳俊友', '林南發', '吳美強', '周俐綠', '韓欣潔', '邱奎榮', '曾舒平', '黃茂儒',
    '黃盈甄', '許聿蘋', '賴盈甄', '吳冠勳', '周平山', '黃鈺虹', '劉琪愛', '張和水', '馮婉玲', '廖誠華',
    '林裕妹', '李依季', '鄭宜靜', '吳寶來', '吳宛花', '陳登薇', '陳志音', '黃玫妏', '姜建文', '陳朝光',
    '黃宗翰', '陳雅筑', '勞俊毅', '白岳宏', '黃淑民', '李佩福', '吳雅妮', '溫忠松', '李卓維', '蘇恒旭',
    '陳靖雯', '章家慧', '趙仕季', '陳偉誠', '賴添威', '賴俊蓁', '何倫然', '吳緯燦', '吳柏妏', '吳秉卿',
    '林家慶', '陳柏毅', '崔鈺婷', '程孝民', '張丞紹', '邱宜伯', '茹蘭喜', '黃金伶', '吳惠竹', '張忠凱',
    '陳丹仰', '蕭惠君', '吳美竹', '張克易', '陳丞霖', '林于山', '陳士凱', '陸素人', '聶佩玲', '許瓊文',
    '劉少弘', '劉宜蓁', '宋靜宜', '張千陽', '羅若柔', '蔡偉倫', '張貞儀', '林怡君', '黎芳宣', '林天鑫',
    '陳宛義', '童憶茵', '郭志峰', '王羿鑫', '李子彥', '洪俞辰', '鄧亞慧', '林玉麟', '詹俊傑', '鄭怡萱',
    '黃雅文', '楊治桓', '曾嘉雯', '陳永生', '何惠萍', '許雲輝', '林家榮', '潘雅婷', '黃珮珊', '陳恭映',
    '陳怡婷', '陳品龍', '陳柏豪', '鄭昶侑', '宋夙江', '許惠文', '曾淑原', '李怡君', '蔡翠均', '鈕意仲',
    '鄭秀珍', '郭朝德', '宋喜宣', '黃耀城', '張瑞枝', '吳淑真', '李珮男', '高承翰', '林雅萍', '陳建羽',
    '趙雅芳', '葉均琴', '李姿君', '敖家豪', '楊俊達', '陳瑋倫', '林雲慈', '張家仲', '馮博文', '姜建興',
    '強萬冰', '宋子翔', '王子安', '童雅婷', '方怡文', '詹京竹', '張瑋然', '林宣伸', '蔣雅雯', '陳哲琇',
    '李珮冰', '鄧姵行', '邱俊紹', '陳國美', '劉慧玲', '邱俊亦', '謝佳法', '張景伸', '劉美雲', '謝心筠',
    '柯秋伯', '吳豪儒', '林薇真', '孫永廷', '楊奇勳', '王昱舜', '陳虹珍', '林雅映', '賴明倫', '劉奕辰',
    '夏哲榮', '王怡均', '吳丞凡', '昝名皓', '張家妃', '蔡佳均', '曹子忠', '陳虹平', '謝桂妤', '李育霖',
    '姚季樂', '楊均谷', '林佳樺', '梁芝琦', '陳建伸', '吳左珊', '胡文彥', '周志妏', '陳琦芸', '王宜學',
    '吳宗恭', '林奕甫', '陳盈民', '黃惠珍', '呂瑤梅', '謝怡君', '周群智', '毛祐海', '游雅雯', '黃志彬',
    '陳慧明', '陳冠香', '姜夢民', '王家瑋', '林得財', '林傑俐', '陳姵瑜', '吳筱貞', '盧富華', '陳恭妤',
    '張怡靜', '羅瑋靖', '林以亦', '蔡家祥', '張聖傑', '吳采馨', '宋佩珊', '吳昱宏', '謝念霖', '蔡剛淳',
    '劉雨龍', '張祐生', '溫夙紋', '丁慧谷', '楊宗泉', '陳佳真', '林佳心', '魯江蓮', '黃家銘', '李群丹',
    '陳冠琬', '陳正諭', '陳宗毅', '張恒雅', '王建輝', '陳雅嵐', '林嘉宏', '陳玉枝', '林柏富', '許軒豪',
    '胥秀芬', '黃莉蓁', '何群菱', '彭希秋', '劉明軒', '陳俊怡', '駱雅鈴', '黃惠芬', '張嘉臻', '蔡玲真',
    '張偉哲', '楊群桂', '林美珮', '黃雅舜', '葉淑君', '宋祥杰', '宋芝清', '林舜財', '謝家佑', '吳逸凡',
    '黃姿芷', '戴名宜', '荊家瑜', '楊義萍', '洪姵君', '翁恭旺', '施彥文', '金宗霖', '林柏鈞', '吳怡文',
    '張淑芬', '游怡芬', '侯綺舜', '陳盈雨', '王沛隆', '李俊緯', '蕭佑霖', '羅介愛', '林豪彥', '周佳儀',
    '貝詩函', '徐嘉珠', '張文茵', '賴麗君', '李芷漢', '黎美惠', '張玉玲', '張隆坤', '馮彥玫', '許淑昌',
    '黃映雯', '金慧茹', '劉曉薇', '韓貞美', '潘淑如', '羅志傑', '陳雅琳', '陳思翰', '陳佩璇', '陳金侑',
    '陳偉翔', '韓呈和', '蔡宛明', '柳伶盛', '吳雅惠', '鐘毓茵', '李欣喬', '李雅芬', '陳俊宏', '林怡均'
)

DISTRICTS = (
    '內湖區',
    '南港區',
    '大安區',
    '松山區',
    '信義區',
    '文山區',
    '大同區',
    '中正區',
    '萬華區',
    '中山區',
    '士林區',
    '北投區',
)

COMPLIMENTS = (
    '{0} is very good', '{0} is excellent', '{0} is brilliant', '{0} is nice', '{0} is a good lecturer',
    '{0} 講的不錯', '{0} 講得很清楚', '{0} 很好', '{0} 讚啦', '{0} 太讚了'
)

COMPLAINTS = (
    '{0} sucks', '{0} is bad', 'I don\'t understand what {0} is talking about...', 'what the hell is {0} doing?', '{0} bollocks',
    '{0} 講得很爛', '我聽不懂 {0} 在講什麼', '{0} 超爛', '{0} 超鳥', '對 {0} 感到無言'
)


def percentage(part, whole):
    return 100 * float(part) / float(whole)

def get_random_age():
    return random.randint(18, 30)

def get_lecturer():
    global IAN_USED
    global HENRY_USED
    lecturer = None
    if random.randint(0, 1) == 0:
        if percentage(IAN_USED, TOTAL_RECORD) < IAN_PERCENTAGE:
            IAN_USED += 1
            lecturer = IAN
        elif percentage(HENRY_USED, TOTAL_RECORD) < HENRY_PERCENTAGE:
            HENRY_USED += 1
            lecturer = HENRY
        else:
            lecturer = LECTURERS[random.randint(0, len(LECTURERS) - 1)]
    else:
        lecturer = LECTURERS[random.randint(0, len(LECTURERS) - 1)]
    return lecturer

def get_comments():
    lecturer = get_lecturer()
    if random.randint(0, 1) == 0:
        comments = COMPLIMENTS[random.randint(0, len(COMPLIMENTS) - 1)]
    else:
        comments = COMPLAINTS[random.randint(0, len(COMPLAINTS) - 1)]
    return comments.format(lecturer)

if __name__ == '__main__':
    for i in xrange(TOTAL_RECORD):
        student = STUDENTS[random.randint(0, len(STUDENTS) - 1)]
        district = DISTRICTS[random.randint(0, len(DISTRICTS) - 1)]
        age = get_random_age()
        comments = get_comments()
        print ','.join((student, str(age), district, comments))
